In [2]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import StandardScaler,LabelEncoder
from sklearn.model_selection import train_test_split
import tensorflow as tf
from tensorflow import keras
import pickle

In [3]:
df = pd.read_csv('Churn_Modelling.csv')

In [4]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [5]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [6]:
df[df.duplicated()]

Empty DataFrame
Columns: [RowNumber, CustomerId, Surname, CreditScore, Geography, Gender, Age, Tenure, Balance, NumOfProducts, HasCrCard, IsActiveMember, EstimatedSalary, Exited]
Index: []

In [7]:
df.drop(['RowNumber','CustomerId','Surname'],axis=1,inplace=True)

In [8]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [9]:
label_encoder_gender  = LabelEncoder()

In [10]:

# Encode Gender column
df['Gender'] = label_encoder_gender.fit_transform(df['Gender'])  # Male->1, Female->0 (or vice versa)

In [11]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,0,41,1,83807.86,1,0,1,112542.58,0
2,502,France,0,42,8,159660.80,3,1,0,113931.57,1
3,699,France,0,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,0,43,2,125510.82,1,1,1,79084.10,0

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  int32
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int32(1), int64(7), object(1)
memory usage: 820.4+ KB

In [13]:
df['EstimatedSalary'] = df['EstimatedSalary'].astype('int64')
df['Balance'] = df['Balance'].astype('int64')

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  int32
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  int64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  int64
 10  Exited           10000 non-null  int64
dtypes: int32(1), int64(9), object(1)
memory usage: 820.4+ KB

In [15]:
df.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,0,42,2,0,1,1,1,101348,1
1,608,Spain,0,41,1,83807,1,0,1,112542,0
2,502,France,0,42,8,159660,3,1,0,113931,1
3,699,France,0,39,1,0,2,0,0,93826,0
4,850,Spain,0,43,2,125510,1,1,1,79084,0

In [16]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder()
geography_encoded = ohe.fit_transform(df[['Geography']])

ohe.get_feature_names_out(['Geography'])

array(['Geography_France', 'Geography_Germany', 'Geography_Spain'],
      dtype=object)

In [17]:
geo_encoded_df = pd.DataFrame(geography_encoded.toarray(), columns=ohe.get_feature_names_out(['Geography']))

In [18]:
geo_encoded_df

      Geography_France  Geography_Germany  Geography_Spain
0                  1.0                0.0              0.0
1                  0.0                0.0              1.0
2                  1.0                0.0              0.0
3                  1.0                0.0              0.0
4                  0.0                0.0              1.0
...                ...                ...              ...
9995               1.0                0.0              0.0
9996               1.0                0.0              0.0
9997               1.0                0.0              0.0
9998               0.0                1.0              0.0
9999               1.0                0.0              0.0

[10000 rows x 3 columns]

In [19]:
df = pd.concat([df, geo_encoded_df], axis=1).drop('Geography', axis=1)

In [20]:
with open('label_Encoder_gender.pkl', 'wb') as file:
    pickle.dump(label_encoder_gender, file)

with open('onehot_encoder_geography.pkl', 'wb') as file:
    pickle.dump(ohe, file)

In [21]:
X = df.drop('Exited',axis=1)
y = df['Exited']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [22]:
df.head()

,CreditScore,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain
0,619,0,42,2,0,1,1,1,101348,1,1.0,0.0,0.0
1,608,0,41,1,83807,1,0,1,112542,0,0.0,0.0,1.0
2,502,0,42,8,159660,3,1,0,113931,1,1.0,0.0,0.0
3,699,0,39,1,0,2,0,0,93826,0,1.0,0.0,0.0
4,850,0,43,2,125510,1,1,1,79084,0,0.0,0.0,1.0

In [23]:
scalar = StandardScaler()

X_train = scalar.fit_transform(X_train)
X_test = scalar.transform(X_test)

In [24]:
with open('scalar.pkl', 'wb') as file:
    pickle.dump(scalar, file)

In [25]:
X_train.shape

(8000, 12)

In [26]:
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
from tensorflow.keras.callbacks import EarlyStopping, TensorBoard
import datetime

In [27]:
model = Sequential()
model.add(Dense(64 , activation="relu",input_shape=(X_train.shape[1],)))
model.add(Dense(32 , activation="relu"))
model.add(Dense(1 , activation="sigmoid"))

In [28]:
optimizer = tf.keras.optimizers.Adam(learning_rate=0.001)

In [29]:
model.compile(
    optimizer = optimizer,
    loss = "binary_crossentropy",
    metrics = ["accuracy"]
)

In [30]:
from tensorflow.keras.callbacks import EarlyStopping, TensorBoard
log_dir = "logs/fit/" + datetime.datetime.now().strftime("%Y%m%d-%H%M%S")
tensorboard_callback = TensorBoard(log_dir=log_dir , histogram_freq=1)

In [31]:
early_stopping_callback = EarlyStopping(monitor="val_loss",patience=20 , restore_best_weights=True)

In [32]:
print(X_train.shape)
print(y_train.shape)

(8000, 12)
(8000,)

In [33]:
history = model.fit(
    X_train,
    y_train,
    validation_data=(X_test, y_test),
    epochs = 100,
    callbacks=[early_stopping_callback, tensorboard_callback]
)

Epoch 1/100
250/250 [==============================] - 3s 6ms/step - loss: 0.4456 - accuracy: 0.8040 - val_loss: 0.3818 - val_accuracy: 0.8410
Epoch 2/100
250/250 [==============================] - 1s 4ms/step - loss: 0.3772 - accuracy: 0.8457 - val_loss: 0.3544 - val_accuracy: 0.8530
Epoch 3/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3536 - accuracy: 0.8568 - val_loss: 0.3462 - val_accuracy: 0.8560
Epoch 4/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3441 - accuracy: 0.8589 - val_loss: 0.3448 - val_accuracy: 0.8575
Epoch 5/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3393 - accuracy: 0.8611 - val_loss: 0.3418 - val_accuracy: 0.8575
Epoch 6/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3355 - accuracy: 0.8627 - val_loss: 0.3420 - val_accuracy: 0.8565
Epoch 7/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3318 - accuracy: 0.8630 - val_loss: 0.3414 - val_accuracy: 0.8545
Epoch 8/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3301 - accuracy: 0.8634 - val_loss: 0.3436 - val_accuracy: 0.8615
Epoch 9/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3272 - accuracy: 0.8633 - val_loss: 0.3422 - val_accuracy: 0.8595
Epoch 10/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3246 - accuracy: 0.8674 - val_loss: 0.3438 - val_accuracy: 0.8645
Epoch 11/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3221 - accuracy: 0.8643 - val_loss: 0.3385 - val_accuracy: 0.8615
Epoch 12/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3218 - accuracy: 0.8629 - val_loss: 0.3381 - val_accuracy: 0.8600
Epoch 13/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3191 - accuracy: 0.8674 - val_loss: 0.3361 - val_accuracy: 0.8625
Epoch 14/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3174 - accuracy: 0.8675 - val_loss: 0.3384 - val_accuracy: 0.8605
Epoch 15/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3155 - accuracy: 0.8659 - val_loss: 0.3405 - val_accuracy: 0.8610
Epoch 16/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3144 - accuracy: 0.8685 - val_loss: 0.3382 - val_accuracy: 0.8595
Epoch 17/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3124 - accuracy: 0.8673 - val_loss: 0.3423 - val_accuracy: 0.8630
Epoch 18/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3115 - accuracy: 0.8716 - val_loss: 0.3408 - val_accuracy: 0.8615
Epoch 19/100
250/250 [==============================] - 1s 3ms/step - loss: 0.3089 - accuracy: 0.8689 - val_loss: 0.3406 - val_accuracy: 0.8630
Epoch 20/100
250/250 [==============================] - 1s 5ms/step - loss: 0.3079 - accuracy: 0.8708 - val_loss: 0.3368 - val_accuracy: 0.8640
Epoch 21/100
250/250 [==============================] - 1s 5ms/step - loss: 0.3081 - accuracy: 0.8696 - val_loss: 0.3421 - val_accuracy: 0.8640
Epoch 22/100
250/250 [==============================] - 1s 6ms/step - loss: 0.3064 - accuracy: 0.8724 - val_loss: 0.3450 - val_accuracy: 0.8655
Epoch 23/100
250/250 [==============================] - 1s 4ms/step - loss: 0.3052 - accuracy: 0.8723 - val_loss: 0.3405 - val_accuracy: 0.8630
Epoch 24/100
250/250 [==============================] - 1s 4ms/step - loss: 0.3028 - accuracy: 0.8737 - val_loss: 0.3431 - val_accuracy: 0.8585
Epoch 25/100
250/250 [==============================] - 1s 4ms/step - loss: 0.3029 - accuracy: 0.8729 - val_loss: 0.3414 - val_accuracy: 0.8650
Epoch 26/100
250/250 [==============================] - 1s 4ms/step - loss: 0.2996 - accuracy: 0.8751 - val_loss: 0.3432 - val_accuracy: 0.8645
Epoch 27/100
250/250 [==============================] - 1s 4ms/step - loss: 0.2974 - accuracy: 0.8749 - val_loss: 0.3508 - val_accuracy: 0.8580
Epoch 28/100
250/250 [==============================] - 1s 3ms/step - loss: 0.2988 - accuracy: 0.8730 - val_loss: 0.3446 - val_accuracy: 0.8605
Epoch 29/100
250/250 [==============================] - 1s 3ms/step - loss: 0.2967 - accuracy: 0.8752 - val_loss: 0.3493 - val_accuracy: 0.8615
Epoch 30/100
250/250 [==============================] - 1s 3ms/step - loss: 0.2952 - accuracy: 0.8759 - val_loss: 0.3415 - val_accuracy: 0.8600
Epoch 31/100
250/250 [==============================] - 1s 4ms/step - loss: 0.2936 - accuracy: 0.8758 - val_loss: 0.3425 - val_accuracy: 0.8640
Epoch 32/100
250/250 [==============================] - 1s 3ms/step - loss: 0.2919 - accuracy: 0.8761 - val_loss: 0.3492 - val_accuracy: 0.8580
Epoch 33/100
250/250 [==============================] - 1s 3ms/step - loss: 0.2903 - accuracy: 0.8784 - val_loss: 0.3485 - val_accuracy: 0.8615

In [34]:
model.save('churn_model.h5')

c:\Users\touqe\anaconda3\envs\ann_env\lib\site-packages\keras\src\engine\training.py:3000: UserWarning: You are saving your model as an HDF5 file via `model.save()`. This file format is considered legacy. We recommend using instead the native Keras format, e.g. `model.save('my_model.keras')`.
  saving_api.save_model(